# FaceArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceArray Constructor
FaceArray Class See Also
---
Initializes a new instance of the FaceArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FaceArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FaceArray()
```

# See Also
FaceArray Class
Autodesk.Revit.DB Namespace